==========================================================================================
                                           Args
==========================================================================================
model: cnn2
batch_size: 100
epochs: 5
lr: 0.1
seq_len: 2
summary: 1
device: cuda:0
display: 1
wait: 0
manual_seed: 1
==========================================================================================


==========================================================================================
                                    Loading model cnn2
==========================================================================================
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Conv2d: 1-1                            [-1, 16, 24, 24]          416
├─ReLU: 1-2                              [-1, 16, 24, 24]          --
├─MaxPool2d: 1-3                         [-1, 16, 12, 12]          --
==========================================================================================
Total params: 416
Trainable params: 416
Non-trainable params: 0
Total mult-adds (M): 0.23
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.07
Params size (MB): 0.00
Estimated Total Size (MB): 0.07
==========================================================================================
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Conv2d: 1-1                            [-1, 32, 8, 8]            12,832
├─ReLU: 1-2                              [-1, 32, 8, 8]            --
├─MaxPool2d: 1-3                         [-1, 32, 4, 4]            --
├─Linear: 1-4                            [-1, 10]                  5,130
==========================================================================================
Total params: 17,962
Trainable params: 17,962
Non-trainable params: 0
Total mult-adds (M): 0.82
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.07
Estimated Total Size (MB): 0.09
==========================================================================================
Epoch: 1. Batch: 300. Loss: 0.1092267632484436. Accuracy: 96.
Epoch: 1. Batch: 600. Loss: 0.050515711307525635. Accuracy: 97.
Epoch: 2. Batch: 300. Loss: 0.0487496480345726. Accuracy: 97.
Epoch: 2. Batch: 600. Loss: 0.041115548461675644. Accuracy: 98.
Epoch: 3. Batch: 300. Loss: 0.024569496512413025. Accuracy: 98.
Epoch: 3. Batch: 600. Loss: 0.03703910857439041. Accuracy: 98.
Epoch: 4. Batch: 300. Loss: 0.06678450852632523. Accuracy: 98.
Epoch: 4. Batch: 600. Loss: 0.02507714182138443. Accuracy: 98.
Epoch: 5. Batch: 300. Loss: 0.04244308918714523. Accuracy: 98.
Epoch: 5. Batch: 600. Loss: 0.01819966919720173. Accuracy: 98.